RT-Thread/rt-thread/bsp/freescale/platform/devices/MK21FA12/include/MK21FA12_extension.h
/*! @brief Set the M2 field to a new value. */
#define AXBS_WR_PRS_M2(base, index, value) (AXBS_RMW_PRS(base, index, AXBS_PRS_M2_MASK, AXBS_PRS_M2(value)))
#define AXBS_BWR_PRS_M2(base, index, value) (AXBS_WR_PRS_M2(base, index, value))
/*@}*/

/*!
 * @name Register AXBS_PRS, field M4[18:16] (RW)
 *
 * Values:
 * - 0b000 - This master has level 1, or highest, priority when accessing the
 *     slave port.
 * - 0b001 - This master has level 2 priority when accessing the slave port.
 * - 0b010 - This master has level 3 priority when accessing the slave port.
 * - 0b011 - This master has level 4 priority when accessing the slave port.
 * - 0b100 - This master has level 5 priority when accessing the slave port.
 * - 0b101 - This master has level 6 priority when accessing the slave port.
 * - 0b110 - This master has level 7 priority when accessing the slave port.
 * - 0b111 - This master has level 8, or lowest, priority when accessing the
 *     slave port.
 */
/*@{*/
/*! @brief Read current value of the AXBS_PRS_M4 field. */
#define AXBS_RD_PRS_M4(base, index) ((AXBS_PRS_REG(base, index) & AXBS_PRS_M4_MASK) >> AXBS_PRS_M4_SHIFT)
#define AXBS_BRD_PRS_M4(base, index) (AXBS_RD_PRS_M4(base, index))

/*! @brief Set the M4 field to a new value. */
#define AXBS_WR_PRS_M4(base, index, value) (AXBS_RMW_PRS(base, index, AXBS_PRS_M4_MASK, AXBS_PRS_M4(value)))
#define AXBS_BWR_PRS_M4(base, index, value) (AXBS_WR_PRS_M4(base, index, value))
/*@}*/

/*!
 * @name Register AXBS_PRS, field M5[22:20] (RW)
 *
 * Values:
 * - 0b000 - This master has level 1, or highest, priority when accessing the
 *     slave port.
 * - 0b001 - This master has level 2 priority when accessing the slave port.
 * - 0b010 - This master has level 3 priority when accessing the slave port.
 * - 0b011 - This master has level 4 priority when accessing the slave port.
 * - 0b100 - This master has level 5 priority when accessing the slave port.
 * - 0b101 - This master has level 6 priority when accessing the slave port.
 * - 0b110 - This master has level 7 priority when accessing the slave port.
 * - 0b111 - This master has level 8, or lowest, priority when accessing the
 *     slave port.
 */
/*@{*/
/*! @brief Read current value of the AXBS_PRS_M5 field. */
#define AXBS_RD_PRS_M5(base, index) ((AXBS_PRS_REG(base, index) & AXBS_PRS_M5_MASK) >> AXBS_PRS_M5_SHIFT)
#define AXBS_BRD_PRS_M5(base, index) (AXBS_RD_PRS_M5(base, index))

/*! @brief Set the M5 field to a new value. */
#define AXBS_WR_PRS_M5(base, index, value) (AXBS_RMW_PRS(base, index, AXBS_PRS_M5_MASK, AXBS_PRS_M5(value)))
#define AXBS_BWR_PRS_M5(base, index, value) (AXBS_WR_PRS_M5(base, index, value))
/*@}*/

/*******************************************************************************
 * AXBS_CRS - Control Register
 ******************************************************************************/

/*!
 * @brief AXBS_CRS - Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * These registers control several features of each slave port and must be
 * accessed using 32-bit accesses. After CRSn[RO] is set, the PRSn can only be read;
 * attempts to write to it have no effect and result in an error response. See the
 * chip-specific crossbar information for the reset value of this register.
 */
/*!
 * @name Constants and macros for entire AXBS_CRS register
 */
/*@{*/
#define AXBS_RD_CRS(base, index) (AXBS_CRS_REG(base, index))
#define AXBS_WR_CRS(base, index, value) (AXBS_CRS_REG(base, index) = (value))
#define AXBS_RMW_CRS(base, index, mask, value) (AXBS_WR_CRS(base, index, (AXBS_RD_CRS(base, index) & ~(mask)) | (value)))
#define AXBS_SET_CRS(base, index, value) (AXBS_WR_CRS(base, index, AXBS_RD_CRS(base, index) |  (value)))
#define AXBS_CLR_CRS(base, index, value) (AXBS_WR_CRS(base, index, AXBS_RD_CRS(base, index) & ~(value)))
#define AXBS_TOG_CRS(base, index, value) (AXBS_WR_CRS(base, index, AXBS_RD_CRS(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual AXBS_CRS bitfields
 */

/*!
 * @name Register AXBS_CRS, field PARK[2:0] (RW)
 *
 * Determines which master port the current slave port parks on when no masters
 * are actively making requests and the PCTL bits are cleared. Select only master
 * ports that are present on the chip. Otherwise, undefined behavior might occur.
 *
 * Values:
 * - 0b000 - Park on master port M0
 * - 0b001 - Park on master port M1
 * - 0b010 - Park on master port M2
 * - 0b011 - Park on master port M3
 * - 0b100 - Park on master port M4
 * - 0b101 - Park on master port M5
 * - 0b110 - Park on master port M6
 * - 0b111 - Park on master port M7
 */
/*@{*/
/*! @brief Read current value of the AXBS_CRS_PARK field. */
#define AXBS_RD_CRS_PARK(base, index) ((AXBS_CRS_REG(base, index) & AXBS_CRS_PARK_MASK) >> AXBS_CRS_PARK_SHIFT)
#define AXBS_BRD_CRS_PARK(base, index) (AXBS_RD_CRS_PARK(base, index))

/*! @brief Set the PARK field to a new value. */
#define AXBS_WR_CRS_PARK(base, index, value) (AXBS_RMW_CRS(base, index, AXBS_CRS_PARK_MASK, AXBS_CRS_PARK(value)))
#define AXBS_BWR_CRS_PARK(base, index, value) (AXBS_WR_CRS_PARK(base, index, value))
/*@}*/

/*!
 * @name Register AXBS_CRS, field PCTL[5:4] (RW)
 *
 * Determines the slave port's parking control. The low-power park feature
 * results in an overall power savings if the slave port is not saturated. However,
 * this forces an extra latency clock when any master tries to access the slave
 * port while not in use because it is not parked on any master.
 *
 * Values:
 * - 0b00 - When no master makes a request, the arbiter parks the slave port on
 *     the master port defined by the PARK field
 * - 0b01 - When no master makes a request, the arbiter parks the slave port on
 *     the last master to be in control of the slave port
 * - 0b10 - When no master makes a request, the slave port is not parked on a
 *     master and the arbiter drives all outputs to a constant safe state
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the AXBS_CRS_PCTL field. */
#define AXBS_RD_CRS_PCTL(base, index) ((AXBS_CRS_REG(base, index) & AXBS_CRS_PCTL_MASK) >> AXBS_CRS_PCTL_SHIFT)
#define AXBS_BRD_CRS_PCTL(base, index) (AXBS_RD_CRS_PCTL(base, index))

/*! @brief Set the PCTL field to a new value. */
#define AXBS_WR_CRS_PCTL(base, index, value) (AXBS_RMW_CRS(base, index, AXBS_CRS_PCTL_MASK, AXBS_CRS_PCTL(value)))
#define AXBS_BWR_CRS_PCTL(base, index, value) (AXBS_WR_CRS_PCTL(base, index, value))
/*@}*/

/*!
 * @name Register AXBS_CRS, field ARB[9:8] (RW)
 *
 * Selects the arbitration policy for the slave port.
 *
 * Values:
 * - 0b00 - Fixed priority
 * - 0b01 - Round-robin, or rotating, priority
 * - 0b10 - Reserved
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the AXBS_CRS_ARB field. */
#define AXBS_RD_CRS_ARB(base, index) ((AXBS_CRS_REG(base, index) & AXBS_CRS_ARB_MASK) >> AXBS_CRS_ARB_SHIFT)
#define AXBS_BRD_CRS_ARB(base, index) (AXBS_RD_CRS_ARB(base, index))

