RT-Thread/rt-thread/bsp/freescale/platform/devices/MK21FA12/include/MK21FA12_extension.h
/*
 * Constants & macros for individual FMC_TAGVDW2S bitfields
 */

/*!
 * @name Register FMC_TAGVDW2S, field valid[0] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_TAGVDW2S_valid field. */
#define FMC_RD_TAGVDW2S_valid(base, index) ((FMC_TAGVDW2S_REG(base, index) & FMC_TAGVDW2S_valid_MASK) >> FMC_TAGVDW2S_valid_SHIFT)
#define FMC_BRD_TAGVDW2S_valid(base, index) (BITBAND_ACCESS32(&FMC_TAGVDW2S_REG(base, index), FMC_TAGVDW2S_valid_SHIFT))

/*! @brief Set the valid field to a new value. */
#define FMC_WR_TAGVDW2S_valid(base, index, value) (FMC_RMW_TAGVDW2S(base, index, FMC_TAGVDW2S_valid_MASK, FMC_TAGVDW2S_valid(value)))
#define FMC_BWR_TAGVDW2S_valid(base, index, value) (BITBAND_ACCESS32(&FMC_TAGVDW2S_REG(base, index), FMC_TAGVDW2S_valid_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_TAGVDW2S, field cache_tag[19:6] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_TAGVDW2S_cache_tag field. */
#define FMC_RD_TAGVDW2S_cache_tag(base, index) ((FMC_TAGVDW2S_REG(base, index) & FMC_TAGVDW2S_cache_tag_MASK) >> FMC_TAGVDW2S_cache_tag_SHIFT)
#define FMC_BRD_TAGVDW2S_cache_tag(base, index) (FMC_RD_TAGVDW2S_cache_tag(base, index))

/*! @brief Set the cache_tag field to a new value. */
#define FMC_WR_TAGVDW2S_cache_tag(base, index, value) (FMC_RMW_TAGVDW2S(base, index, FMC_TAGVDW2S_cache_tag_MASK, FMC_TAGVDW2S_cache_tag(value)))
#define FMC_BWR_TAGVDW2S_cache_tag(base, index, value) (FMC_WR_TAGVDW2S_cache_tag(base, index, value))
/*@}*/

/*******************************************************************************
 * FMC_TAGVDW3S - Cache Tag Storage
 ******************************************************************************/

/*!
 * @brief FMC_TAGVDW3S - Cache Tag Storage (RW)
 *
 * Reset value: 0x00000000U
 *
 * The 128-entry cache is a 4-way, set-associative cache with 4 sets. The ways
 * are numbered 0-3 and the sets are numbered 0-3. In TAGVDWxSy, x denotes the
 * way, and y denotes the set. This section represents tag/vld information for all
 * sets (n=0-3) in way 3.
 */
/*!
 * @name Constants and macros for entire FMC_TAGVDW3S register
 */
/*@{*/
#define FMC_RD_TAGVDW3S(base, index) (FMC_TAGVDW3S_REG(base, index))
#define FMC_WR_TAGVDW3S(base, index, value) (FMC_TAGVDW3S_REG(base, index) = (value))
#define FMC_RMW_TAGVDW3S(base, index, mask, value) (FMC_WR_TAGVDW3S(base, index, (FMC_RD_TAGVDW3S(base, index) & ~(mask)) | (value)))
#define FMC_SET_TAGVDW3S(base, index, value) (FMC_WR_TAGVDW3S(base, index, FMC_RD_TAGVDW3S(base, index) |  (value)))
#define FMC_CLR_TAGVDW3S(base, index, value) (FMC_WR_TAGVDW3S(base, index, FMC_RD_TAGVDW3S(base, index) & ~(value)))
#define FMC_TOG_TAGVDW3S(base, index, value) (FMC_WR_TAGVDW3S(base, index, FMC_RD_TAGVDW3S(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FMC_TAGVDW3S bitfields
 */

/*!
 * @name Register FMC_TAGVDW3S, field valid[0] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_TAGVDW3S_valid field. */
#define FMC_RD_TAGVDW3S_valid(base, index) ((FMC_TAGVDW3S_REG(base, index) & FMC_TAGVDW3S_valid_MASK) >> FMC_TAGVDW3S_valid_SHIFT)
#define FMC_BRD_TAGVDW3S_valid(base, index) (BITBAND_ACCESS32(&FMC_TAGVDW3S_REG(base, index), FMC_TAGVDW3S_valid_SHIFT))

/*! @brief Set the valid field to a new value. */
#define FMC_WR_TAGVDW3S_valid(base, index, value) (FMC_RMW_TAGVDW3S(base, index, FMC_TAGVDW3S_valid_MASK, FMC_TAGVDW3S_valid(value)))
#define FMC_BWR_TAGVDW3S_valid(base, index, value) (BITBAND_ACCESS32(&FMC_TAGVDW3S_REG(base, index), FMC_TAGVDW3S_valid_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_TAGVDW3S, field cache_tag[19:6] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_TAGVDW3S_cache_tag field. */
#define FMC_RD_TAGVDW3S_cache_tag(base, index) ((FMC_TAGVDW3S_REG(base, index) & FMC_TAGVDW3S_cache_tag_MASK) >> FMC_TAGVDW3S_cache_tag_SHIFT)
#define FMC_BRD_TAGVDW3S_cache_tag(base, index) (FMC_RD_TAGVDW3S_cache_tag(base, index))

/*! @brief Set the cache_tag field to a new value. */
#define FMC_WR_TAGVDW3S_cache_tag(base, index, value) (FMC_RMW_TAGVDW3S(base, index, FMC_TAGVDW3S_cache_tag_MASK, FMC_TAGVDW3S_cache_tag(value)))
#define FMC_BWR_TAGVDW3S_cache_tag(base, index, value) (FMC_WR_TAGVDW3S_cache_tag(base, index, value))
/*@}*/

/*******************************************************************************
 * FMC_DATA_UM - Cache Data Storage (uppermost word)
 ******************************************************************************/

/*!
 * @brief FMC_DATA_UM - Cache Data Storage (uppermost word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * uppermost word (bits [127:96]) of all 4 sets (n=0-3) in way 0.
 */
/*!
 * @name Constants and macros for entire FMC_DATA_UM register
 */
/*@{*/
#define FMC_RD_DATA_UM(base, index, index2) (FMC_DATA_UM_REG(base, index, index2))
#define FMC_WR_DATA_UM(base, index, index2, value) (FMC_DATA_UM_REG(base, index, index2) = (value))
#define FMC_RMW_DATA_UM(base, index, index2, mask, value) (FMC_WR_DATA_UM(base, index, index2, (FMC_RD_DATA_UM(base, index, index2) & ~(mask)) | (value)))
#define FMC_SET_DATA_UM(base, index, index2, value) (FMC_WR_DATA_UM(base, index, index2, FMC_RD_DATA_UM(base, index, index2) |  (value)))
#define FMC_CLR_DATA_UM(base, index, index2, value) (FMC_WR_DATA_UM(base, index, index2, FMC_RD_DATA_UM(base, index, index2) & ~(value)))
#define FMC_TOG_DATA_UM(base, index, index2, value) (FMC_WR_DATA_UM(base, index, index2, FMC_RD_DATA_UM(base, index, index2) ^  (value)))
/*@}*/

/*******************************************************************************
 * FMC_DATA_MU - Cache Data Storage (mid-upper word)
 ******************************************************************************/

/*!
 * @brief FMC_DATA_MU - Cache Data Storage (mid-upper word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * mid-upper word (bits [95:64]) of all 4 sets (n=0-3) in way 0.
 */
/*!
 * @name Constants and macros for entire FMC_DATA_MU register
 */
/*@{*/
#define FMC_RD_DATA_MU(base, index, index2) (FMC_DATA_MU_REG(base, index, index2))
#define FMC_WR_DATA_MU(base, index, index2, value) (FMC_DATA_MU_REG(base, index, index2) = (value))
#define FMC_RMW_DATA_MU(base, index, index2, mask, value) (FMC_WR_DATA_MU(base, index, index2, (FMC_RD_DATA_MU(base, index, index2) & ~(mask)) | (value)))
#define FMC_SET_DATA_MU(base, index, index2, value) (FMC_WR_DATA_MU(base, index, index2, FMC_RD_DATA_MU(base, index, index2) |  (value)))
#define FMC_CLR_DATA_MU(base, index, index2, value) (FMC_WR_DATA_MU(base, index, index2, FMC_RD_DATA_MU(base, index, index2) & ~(value)))
#define FMC_TOG_DATA_MU(base, index, index2, value) (FMC_WR_DATA_MU(base, index, index2, FMC_RD_DATA_MU(base, index, index2) ^  (value)))
/*@}*/

