RT-Thread/rt-thread/bsp/freescale/platform/devices/MK21FA12/include/MK21FA12_extension.h
/*******************************************************************************
 * FTFE_FOPT - Flash Option Register
 ******************************************************************************/

/*!
 * @brief FTFE_FOPT - Flash Option Register (RO)
 *
 * Reset value: 0x00U
 *
 * The flash option register allows the MCU to customize its operations by
 * examining the state of these read-only bits, which are loaded from NVM at reset.
 * The function of the bits is defined in the device's Chip Configuration details.
 * All bits in the register are read-only. During the reset sequence, the
 * register is loaded from the flash nonvolatile option byte in the Flash Configuration
 * Field located in program flash memory. The flash basis for the values is
 * signified by X in the reset value.
 */
/*!
 * @name Constants and macros for entire FTFE_FOPT register
 */
/*@{*/
#define FTFE_RD_FOPT(base)       (FTFE_FOPT_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB3 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB3 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB3 register
 */
/*@{*/
#define FTFE_RD_FCCOB3(base)     (FTFE_FCCOB3_REG(base))
#define FTFE_WR_FCCOB3(base, value) (FTFE_FCCOB3_REG(base) = (value))
#define FTFE_RMW_FCCOB3(base, mask, value) (FTFE_WR_FCCOB3(base, (FTFE_RD_FCCOB3(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB3(base, value) (FTFE_WR_FCCOB3(base, FTFE_RD_FCCOB3(base) |  (value)))
#define FTFE_CLR_FCCOB3(base, value) (FTFE_WR_FCCOB3(base, FTFE_RD_FCCOB3(base) & ~(value)))
#define FTFE_TOG_FCCOB3(base, value) (FTFE_WR_FCCOB3(base, FTFE_RD_FCCOB3(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB2 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB2 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB2 register
 */
/*@{*/
#define FTFE_RD_FCCOB2(base)     (FTFE_FCCOB2_REG(base))
#define FTFE_WR_FCCOB2(base, value) (FTFE_FCCOB2_REG(base) = (value))
#define FTFE_RMW_FCCOB2(base, mask, value) (FTFE_WR_FCCOB2(base, (FTFE_RD_FCCOB2(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB2(base, value) (FTFE_WR_FCCOB2(base, FTFE_RD_FCCOB2(base) |  (value)))
#define FTFE_CLR_FCCOB2(base, value) (FTFE_WR_FCCOB2(base, FTFE_RD_FCCOB2(base) & ~(value)))
#define FTFE_TOG_FCCOB2(base, value) (FTFE_WR_FCCOB2(base, FTFE_RD_FCCOB2(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB1 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB1 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB1 register
 */
/*@{*/
#define FTFE_RD_FCCOB1(base)     (FTFE_FCCOB1_REG(base))
#define FTFE_WR_FCCOB1(base, value) (FTFE_FCCOB1_REG(base) = (value))
#define FTFE_RMW_FCCOB1(base, mask, value) (FTFE_WR_FCCOB1(base, (FTFE_RD_FCCOB1(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB1(base, value) (FTFE_WR_FCCOB1(base, FTFE_RD_FCCOB1(base) |  (value)))
#define FTFE_CLR_FCCOB1(base, value) (FTFE_WR_FCCOB1(base, FTFE_RD_FCCOB1(base) & ~(value)))
#define FTFE_TOG_FCCOB1(base, value) (FTFE_WR_FCCOB1(base, FTFE_RD_FCCOB1(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB0 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB0 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB0 register
 */
/*@{*/
#define FTFE_RD_FCCOB0(base)     (FTFE_FCCOB0_REG(base))
#define FTFE_WR_FCCOB0(base, value) (FTFE_FCCOB0_REG(base) = (value))
#define FTFE_RMW_FCCOB0(base, mask, value) (FTFE_WR_FCCOB0(base, (FTFE_RD_FCCOB0(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB0(base, value) (FTFE_WR_FCCOB0(base, FTFE_RD_FCCOB0(base) |  (value)))
#define FTFE_CLR_FCCOB0(base, value) (FTFE_WR_FCCOB0(base, FTFE_RD_FCCOB0(base) & ~(value)))
#define FTFE_TOG_FCCOB0(base, value) (FTFE_WR_FCCOB0(base, FTFE_RD_FCCOB0(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB7 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB7 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB7 register
 */
/*@{*/
#define FTFE_RD_FCCOB7(base)     (FTFE_FCCOB7_REG(base))
#define FTFE_WR_FCCOB7(base, value) (FTFE_FCCOB7_REG(base) = (value))
#define FTFE_RMW_FCCOB7(base, mask, value) (FTFE_WR_FCCOB7(base, (FTFE_RD_FCCOB7(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB7(base, value) (FTFE_WR_FCCOB7(base, FTFE_RD_FCCOB7(base) |  (value)))
#define FTFE_CLR_FCCOB7(base, value) (FTFE_WR_FCCOB7(base, FTFE_RD_FCCOB7(base) & ~(value)))
#define FTFE_TOG_FCCOB7(base, value) (FTFE_WR_FCCOB7(base, FTFE_RD_FCCOB7(base) ^  (value)))
/*@}*/

